ChipWright/chipwright/sdk/firmware/targets/esp32c6-matter/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# 8 MB flash on the ESP32-C6-DevKitC-1-N8
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# BLE (NimBLE) for commissioning
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Matter over Wi-Fi: station only, no SoftAP, no Thread
CONFIG_ENABLE_WIFI_STATION=y
CONFIG_ENABLE_WIFI_AP=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Custom partition table with the Matter layout
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

# IPv6, required by Matter
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

# HKDF in mbedTLS, used by Matter
CONFIG_MBEDTLS_HKDF_C=y

CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=4

# Non-concurrent commissioning: the device tears down BLE before joining Wi-Fi, so the
# single 2.4 GHz radio is not shared between BLE and the Wi-Fi scan/connect. On the C6 the
# concurrent path starves the Wi-Fi scan ("no suitable AP" + coexistence connect failures).
CONFIG_ENABLE_CONCURRENT_CONNECTION=n
